languages = [
    {
        "Название": 'Python',
        "Год выпуска": 1991,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 14.85,
        "Октябрь 2023": 1,
        "Октябрь 2022": 1
    },
    {
        "Название": 'C',
        "Год выпуска": 1972,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 12.08,
        "Октябрь 2023": 2,
        "Октябрь 2022": 2
    },
    {
        "Название": 'C++',
        "Год выпуска": 1985,
        "Тип языка": 'Компилируемый объектно-ориентированный',
        "Рейтинг": 10.67,
        "Октябрь 2023": 3,
        "Октябрь 2022": 4
    },
    {
        "Название": 'Java',
        "Год выпуска": 1995,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 8.92,
        "Октябрь 2023": 4,
        "Октябрь 2022": 3
    },
    {
        "Название": 'C#',
        "Год выпуска": 2000,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 7.71,
        "Октябрь 2023": 5,
        "Октябрь 2022": 5
    },
    {
        "Название": 'JavaScript',
        "Год выпуска": 1995,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 2.91,
        "Октябрь 2023": 6,
        "Октябрь 2022": 7
    },
    {
        "Название": 'Visual Basic',
        "Год выпуска": 1991,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 2.13,
        "Октябрь 2023": 7,
        "Октябрь 2022": 6
    },
    {
        "Название": 'PHP',
        "Год выпуска": 1995,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 1.9,
        "Октябрь 2023": 8,
        "Октябрь 2022": 9
    },
    {
        "Название": 'SQL',
        "Год выпуска": 1974,
        "Тип языка": 'Язык структурированных запросов',
        "Рейтинг": 1.78,
        "Октябрь 2023": 9,
        "Октябрь 2022": 10
    },
    {
        "Название": 'Assembly language',
        "Год выпуска": 1949,
        "Тип языка": 'Низкоуровневый',
        "Рейтинг": 1.64,
        "Октябрь 2023": 10,
        "Октябрь 2022": 8
    },
    {
        "Название": 'Go',
        "Год выпуска": 2009,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 1.37,
        "Октябрь 2023": 11,
        "Октябрь 2022": 11
    },
    {
        "Название": 'Scratch',
        "Год выпуска": 2007,
        "Тип языка": 'Визуальный',
        "Рейтинг": 1.37,
        "Октябрь 2023": 12,
        "Октябрь 2022": 23
    },
    {
        "Название": 'Delphi/Object',
        "Год выпуска": 1995,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 1.30,
        "Октябрь 2023": 13,
        "Октябрь 2022": 18
    },
    {
        "Название": 'MATLAB',
        "Год выпуска": 1984,
        "Тип языка": 'Вычислительный',
        "Рейтинг": 1.27,
        "Октябрь 2023": 14,
        "Октябрь 2022": 14
    },
    {
        "Название": 'Swift',
        "Год выпуска": 2014,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 1.07,
        "Октябрь 2023": 15,
        "Октябрь 2022": 15
    },
    {
        "Название": 'Fortran',
        "Год выпуска": 1957,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 1.02,
        "Октябрь 2023": 16,
        "Октябрь 2022": 19
    },
    {
        "Название": 'R',
        "Год выпуска": 1993,
        "Тип языка": 'Математический',
        "Рейтинг": 0.96,
        "Октябрь 2023": 17,
        "Октябрь 2022": 12
    },
    {
        "Название": 'Kotlin',
        "Год выпуска": 2011,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.96,
        "Октябрь 2023": 18,
        "Октябрь 2022": 28
    },
    {
        "Название": 'Ruby',
        "Год выпуска": 1995,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.92,
        "Октябрь 2023": 19,
        "Октябрь 2022": 26
    },
    {
        "Название": 'Rust',
        "Год выпуска": 2010,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 0.91,
        "Октябрь 2023": 20,
        "Октябрь 2022": 20
    },
    {
        "Название": 'Classic Visual Basic',
        "Год выпуска": 1991,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.9,
        "Октябрь 2023": 21,
        "Октябрь 2022": 17
    },
    {
        "Название": 'SAS',
        "Год выпуска": 1966,
        "Тип языка": 'Математический',
        "Рейтинг": 0.83,
        "Октябрь 2023": 22,
        "Октябрь 2022": 21
    },
    {
        "Название": 'Ada',
        "Год выпуска": 1980,
        "Тип языка": 'Данные',
        "Рейтинг": 0.77,
        "Октябрь 2023": 23,
        "Октябрь 2022": 31
    },
    {
        "Название": 'COBOL',
        "Год выпуска": 1959,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 0.76,
        "Октябрь 2023": 24,
        "Октябрь 2022": 30
    },
    {
        "Название": 'Prolog',
        "Год выпуска": 1972,
        "Тип языка": 'Декларативный',
        "Рейтинг": 0.7,
        "Октябрь 2023": 25,
        "Октябрь 2022": 25
    },
    {
        "Название": 'Lua',
        "Год выпуска": 1993,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 0.7,
        "Октябрь 2023": 26,
        "Октябрь 2022": 24
    },
    {
        "Название": 'Perl',
        "Год выпуска": 1987,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 0.64,
        "Октябрь 2023": 27,
        "Октябрь 2022": 22
    },
    {
        "Название": 'Julia',
        "Год выпуска": 2012,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 0.58,
        "Октябрь 2023": 28,
        "Октябрь 2022": 27
    },
    {
        "Название": 'D',
        "Год выпуска": 2001,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 0.56,
        "Октябрь 2023": 29,
        "Октябрь 2022": 38
    },
    {
        "Название": '(Visual) FoxPro',
        "Год выпуска": 1984,
        "Тип языка": 'Компилируемый',
        "Рейтинг": 0.53,
        "Октябрь 2023": 31,
        "Октябрь 2022": 32
    },
    {
        "Название": 'Dart',
        "Год выпуска": 2011,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.47,
        "Октябрь 2023": 31,
        "Октябрь 2022": 33
    },
    {
        "Название": 'Haskell',
        "Год выпуска": 1990,
        "Тип языка": 'Функцианальный',
        "Рейтинг": 0.46,
        "Октябрь 2023": 32,
        "Октябрь 2022": 39
    },
    {
        "Название": 'Objective-C',
        "Год выпуска": 1984,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.45,
        "Октябрь 2023": 33,
        "Октябрь 2022": 13
    },
    {
        "Название": 'Transact-SQL',
        "Год выпуска": 1986,
        "Тип языка": 'Базы данных',
        "Рейтинг": 0.45,
        "Октябрь 2023": 34,
        "Октябрь 2022": 37
    },
    {
        "Название": 'Lisp',
        "Год выпуска": 1958,
        "Тип языка": 'Функцианальный',
        "Рейтинг": 0.41,
        "Октябрь 2023": 35,
        "Октябрь 2022": 26
    },
    {
        "Название": 'F#',
        "Год выпуска": 2005,
        "Тип языка": 'Функцианальный',
        "Рейтинг": 0.4,
        "Октябрь 2023": 36,
        "Октябрь 2022": 36
    },
    {
        "Название": 'GAMS',
        "Год выпуска": 1979,
        "Тип языка": 'Математический',
        "Рейтинг": 0.39,
        "Октябрь 2023": 37,
        "Октябрь 2022": 51
    },
    {
        "Название": 'Scala',
        "Год выпуска": 2004,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.36,
        "Октябрь 2023": 38,
        "Октябрь 2022": 29
    },
    {
        "Название": 'VBScript',
        "Год выпуска": 1996,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 0.35,
        "Октябрь 2023": 39,
        "Октябрь 2022": 98
    },
    {
        "Название": 'Logo',
        "Год выпуска": 1967,
        "Тип языка": 'Образовательный',
        "Рейтинг": 0.33,
        "Октябрь 2023": 40,
        "Октябрь 2022": 40
    },
    {
        "Название": 'PL/SQL',
        "Год выпуска": 1980,
        "Тип языка": 'Базы данных',
        "Рейтинг": 0.28,
        "Октябрь 2023": 41,
        "Октябрь 2022": 25
    },
    {
        "Название": 'Bash',
        "Год выпуска": 1989,
        "Тип языка": 'Unix',
        "Рейтинг": 0.27,
        "Октябрь 2023": 42,
        "Октябрь 2022": 47
    },
    {
        "Название": 'CFML',
        "Год выпуска": 1995,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 0.25,
        "Октябрь 2023": 43,
        "Октябрь 2022": 52
    },
    {
        "Название": 'PowerShell',
        "Год выпуска": 2006,
        "Тип языка": 'Скриптовый',
        "Рейтинг": 0.24,
        "Октябрь 2023": 44,
        "Октябрь 2022": 36
    },
    {
        "Название": 'Solidity',
        "Год выпуска": 2014,
        "Тип языка": 'Block Chain',
        "Рейтинг": 0.24,
        "Октябрь 2023": 45,
        "Октябрь 2022": 42
    },
    {
        "Название": 'Scheme',
        "Год выпуска": 1975,
        "Тип языка": 'Диалект',
        "Рейтинг": 0.24,
        "Октябрь 2023": 46,
        "Октябрь 2022": 41
    },
    {
        "Название": 'ABAP',
        "Год выпуска": 1983,
        "Тип языка": 'Диалект',
        "Рейтинг": 0.22,
        "Октябрь 2023": 47,
        "Октябрь 2022": 35
    },
    {
        "Название": 'X++',
        "Год выпуска": 2002,
        "Тип языка": 'Объектно-ориентированный',
        "Рейтинг": 0.22,
        "Октябрь 2023": 49,
        "Октябрь 2022": 49
    },
    {
        "Название": 'TypeScript',
        "Год выпуска": 2012,
        "Тип языка": 'Диалект',
        "Рейтинг": 0.2,
        "Октябрь 2023": 49,
        "Октябрь 2022": 43
    },
    {
        "Название": 'Awk',
        "Год выпуска": 1977,
        "Тип языка": 'Данные',
        "Рейтинг": 0.2,
        "Октябрь 2023": 50,
        "Октябрь 2022": 53
    }
];
